#include <stdio.h>
#include <stdlib.h>

int main()
{
    double n;
    printf("输入利润：");
    scanf("%lf",&n);
    switch(n>0)
    {
    case n<100000:
        printf("利润为%lf的奖金=%lf",n,n*0.1);
        break;
    case n<200000:
        printf("利润为%lf的奖金=%lf",n,100000*0.1+(n-100000)*0.075);
    case n<400000:
        printf("利润为%lf的奖金=%lf",n,100000*0.1+100000*0.075+(n-200000)*0.05);
    case n<600000:
        printf("利润为%lf的奖金=%lf",n,100000*0.1+100000*0.075+200000*0.05+(n-400000)*0.03);
    case n<1000000:
        printf("利润为%lf的奖金=%lf",n,100000*0.1+100000*0.075+200000*0.05+200000*0.03+(n-600000)*0.015);
    default:
        printf("利润为%lf的奖金=%lf",n,100000*0.1+100000*0.075+200000*0.05+200000*0.03+400000*0.015+(n-1000000)*0.01);
    }
    return 0;
}
